accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/orders/MNPGetRequestInfo-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:mnp="http://xmlns.du.ae/LCE/Business/RequestManagement/MNPGetRequestInfo">
   <soapenv:Header/>
   <soapenv:Body>
      <web:MNPGetRequestInfoResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <mnp:RequestId>?</mnp:RequestId>
               <!--Optional:-->
               <mnp:TxnId>?</mnp:TxnId>
               <!--Optional:-->
               <mnp:OrderId>?</mnp:OrderId>
               <!--Optional:-->
               <mnp:CustomerIdPub>?</mnp:CustomerIdPub>
               <!--Optional:-->
               <mnp:ContractIdPub>?</mnp:ContractIdPub>
               <!--Optional:-->
               <mnp:DirNumId>?</mnp:DirNumId>
               <mnp:DirNum>?</mnp:DirNum>
               <!--Optional:-->
               <mnp:EntryDate>?</mnp:EntryDate>
               <mnp:Status>?</mnp:Status>
               <mnp:RequestIdStatus>?</mnp:RequestIdStatus>
               <mnp:RequestStatusDesc>?</mnp:RequestStatusDesc>
               <!--Optional:-->
               <mnp:StartDate>?</mnp:StartDate>
               <!--Optional:-->
               <mnp:EndDate>?</mnp:EndDate>
               <!--Optional:-->
               <mnp:ActionType>?</mnp:ActionType>
               <mnp:CustomerCode>?</mnp:CustomerCode>
               <!--Optional:-->
               <mnp:DocLink1>?</mnp:DocLink1>
               <!--Optional:-->
               <mnp:DocLink2>?</mnp:DocLink2>
               <!--Optional:-->
               <mnp:DocLink3>?</mnp:DocLink3>
               <!--Optional:-->
               <mnp:DocType1>?</mnp:DocType1>
               <!--Optional:-->
               <mnp:DocType2>?</mnp:DocType2>
               <!--Optional:-->
               <mnp:DocType3>?</mnp:DocType3>
               <!--Optional:-->
               <mnp:Comments>?</mnp:Comments>
               <!--Optional:-->
               <mnp:SubmissionDate>?</mnp:SubmissionDate>
               <!--Optional:-->
               <mnp:OwnerId>?</mnp:OwnerId>
               <!--Optional:-->
               <mnp:Owner>?</mnp:Owner>
               <!--Optional:-->
               <mnp:OwnerTeam>?</mnp:OwnerTeam>
               <!--Zero or more repetitions:-->
               <mnp:ValidationResults>
                  <!--Optional:-->
                  <mnp:Code>?</mnp:Code>
                  <!--Optional:-->
                  <mnp:Passed>?</mnp:Passed>
               </mnp:ValidationResults>
               <!--Zero or more repetitions:-->
               <mnp:NumberRange>
                  <!--Optional:-->
                  <mnp:FromTo>?</mnp:FromTo>
                  <!--Optional:-->
                  <mnp:Reason>?</mnp:Reason>
               </mnp:NumberRange>
               <!--Zero or more repetitions:-->
               <mnp:History>
                  <mnp:SeqNumber>?</mnp:SeqNumber>
                  <!--Optional:-->
                  <mnp:ValidDate>?</mnp:ValidDate>
                  <mnp:Status>?</mnp:Status>
                  <mnp:StatusId>?</mnp:StatusId>
                  <!--Optional:-->
                  <mnp:Details>?</mnp:Details>
               </mnp:History>
            </lcew:Body>
         </Response>
      </web:MNPGetRequestInfoResponse>
   </soapenv:Body>
</soapenv:Envelope>